const smartFixedHeader = function () {
  var e = window;
  const t = document.body;
  const o = t.querySelector(".header");
  let n = e.pageYOffset;
  (n < +e.prevOffset || n < 75) &&
    (o.classList.add("header--sticky"), o.classList.remove("header--default")),
    0 === n && o.classList.add("header--default"),
    (window.prevOffset = e.pageYOffset),
    (n /=
      document.documentElement.scrollHeight -
      (e.innerHeight || document.documentElement.clientHeight)),
    n < 0 && (n = 0),
    1 < n && (n = 1);
};
function anim(e, t, o) {
  var n = "animate__",
    o = o ? parseFloat(o) : 0.15;
  e.classList.add("wow", `${n}animated`, `${n}${t}`),
    0 < o && e.style.setProperty("animation-delay", `${o}s`);
}
document.body.contains(document.querySelector(".header")) &&
  (window.addEventListener("scroll", smartFixedHeader), smartFixedHeader()),
  (wow = new WOW({ offset: 100 })),
  wow.init();
const $animateEls = document.querySelectorAll(".animated");
$animateEls.forEach((e, t) => {
  anim(e, "fadeIn");
});
const $authorPhotos = document.querySelectorAll(
  ".collection-page__author-photos img"
);
function introAnimation() {
  const n = document.querySelector(".intro-t__logo"),
    a = document.querySelector(".intro-t__btn");
  gsap.fromTo(
    n,
    { translateY: "-50px", opacity: 0 },
    { translateY: "0px", opacity: 1, duration: 1.5, delay: 0.5, ease: "expo" }
  ),
    gsap.fromTo(
      a,
      { translateY: "50px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 1.5, delay: 1, ease: "expo" }
    ),
    a.addEventListener("click", (e) => {
      e.preventDefault();
      const o = e.target.getAttribute("href");
      return new Promise((e) => {
        const t = gsap.timeline();
        t.to(n, {
          translateY: "-50px",
          opacity: 0,
          duration: 1.5,
          ease: "expo",
        })
          .to(
            a,
            { translateY: "50px", opacity: 0, duration: 1.5, ease: "expo" },
            "<"
          )
          .add(e)
          .then(() =>
            (function (e) {
              e && (window.location.href = e);
            })(o)
          );
      });
    });
}
function throttle(e, t) {
  let o = Date.now();
  return function () {
    o + t - Date.now() < 0 && (e(), (o = Date.now()));
  };
}
function pageKraft() {
  var e = document.querySelector(".page-kraft-intro__bg-logo"),
    t = document.querySelector(".collection-page-intro__bg-left"),
    o = document.querySelector(".collection-page-intro__bg-right"),
    n = document.querySelector(".page-kraft-intro__hero");
  gsap.fromTo(
    t,
    { translateX: "-700px", translateY: "400px", opacity: 0 },
    {
      translateX: "0px",
      translateY: "0px",
      opacity: 1,
      duration: 1,
      delay: 1,
      ease: "expo",
    }
  ),
    gsap.fromTo(
      o,
      { translateX: "400px", translateY: "-250px", opacity: 0 },
      {
        translateX: "0px",
        translateY: "0px",
        opacity: 1,
        duration: 1,
        delay: 1,
        ease: "expo",
      }
    ),
    gsap.fromTo(
      n,
      { translateY: "400px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 2, delay: 0.5, ease: "expo" }
    ),
    gsap.fromTo(e, { opacity: 0 }, { opacity: 1, duration: 2, delay: 1.5 }),
    window.addEventListener(
      "scroll",
      throttle(function () {
        const e = window.pageYOffset,
          t = document.querySelector(".page-kraft-intro__bg-logo"),
          o = document.querySelector(".page-kraft-intro__float"),
          n = document.querySelector(".page-kraft-intro__hero");
        (n.style.transform = "translateY(" + 0.1 * -e + "px)"),
          (o.style.transform = "translateY(" + 0.25 * e + "px)"),
          (t.style.transform = "translateY(" + -0.15 * e + "px)");
      }, 14)
    );
}
function pageOdintri() {
  var e = document.querySelector(".page-odintri-intro__logo"),
    t = document.querySelector(".page-odintri-intro__smoke_left"),
    o = document.querySelector(".page-odintri-intro__smoke_right"),
    n = document.querySelector(".page-odintri-intro__spark"),
    a = document.querySelector(".page-odintri-intro__hero");
  gsap.fromTo(
    t,
    { translateX: "-700px", opacity: 0 },
    { translateX: "0px", opacity: 1, duration: 1.5, delay: 1, ease: "expo" }
  ),
    gsap.fromTo(
      o,
      { translateX: "400px", opacity: 0 },
      {
        translateX: "0px",
        opacity: 1,
        duration: 1.5,
        delay: 1.15,
        ease: "expo",
      }
    ),
    gsap.fromTo(
      n,
      { translateY: "-200px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 2, delay: 0.5, ease: "expo" }
    ),
    gsap.fromTo(
      a,
      { translateY: "400px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 2, delay: 0.5, ease: "expo" }
    ),
    gsap.fromTo(e, { opacity: 0 }, { opacity: 1, duration: 2, delay: 0.75 }),
    window.addEventListener(
      "scroll",
      throttle(function () {
        const e = window.pageYOffset,
          t = document.querySelector(".page-odintri-intro__logo"),
          o = document.querySelector(".page-odintri-intro__spark"),
          n = document.querySelector(".page-odintri-intro__hero");
        (n.style.transform = "translateY(" + 0.1 * -e + "px)"),
          (o.style.transform = "translateY(" + 0.25 * e + "px)"),
          (t.style.transform = "translateY(" + -0.15 * e + "px)");
      }, 14)
    );
}
function pageGolopolosov() {
  var e = document.querySelector(".page-golopolosov-intro__logo"),
    t = document.querySelector(".page-golopolosov-intro__light-l"),
    o = document.querySelector(".page-golopolosov-intro__light-r"),
    n = document.querySelector(".page-golopolosov-intro__hero-img");
  gsap.fromTo(
    t,
    { translateY: "-700px", opacity: 0 },
    { translateY: "0px", opacity: 1, duration: 1.5, delay: 1.1, ease: "expo" }
  ),
    gsap.fromTo(
      o,
      { translateY: "400px", opacity: 0 },
      {
        translateY: "0px",
        opacity: 1,
        duration: 1.5,
        delay: 1.25,
        ease: "expo",
      }
    ),
    gsap.fromTo(
      n,
      { translateY: "-200px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 2, delay: 0.75, ease: "expo" }
    ),
    gsap.fromTo(e, { opacity: 0 }, { opacity: 1, duration: 2, delay: 1.5 }),
    window.addEventListener(
      "scroll",
      throttle(function () {
        const e = window.pageYOffset,
          t = document.querySelector(".page-golopolosov-intro__logo"),
          o = document.querySelector(".page-golopolosov-intro__light-l"),
          n = document.querySelector(".page-golopolosov-intro__light-r");
        (o.style.transform = "translateY(" + 0.18 * -e + "px)"),
          (n.style.transform = "translateY(" + 0.1 * -e + "px)"),
          (t.style.transform = "translateY(" + 0.1 * -e + "px)");
      }, 14)
    );
}
function CollectionIntroAnimation() {
  var e = document.querySelector(".collection-page-intro__bg-logo"),
    t = document.querySelector(".collection-page-intro__bg-left"),
    o = document.querySelector(".collection-page-intro__bg-right"),
    n = document.querySelector(".collection-page-intro__pers");
  gsap.fromTo(
    t,
    { translateX: "-700px", translateY: "400px", opacity: 0 },
    {
      translateX: "0px",
      translateY: "0px",
      opacity: 1,
      duration: 1,
      delay: 1,
      ease: "expo",
    }
  ),
    gsap.fromTo(
      o,
      { translateX: "400px", translateY: "-250px", opacity: 0 },
      {
        translateX: "0px",
        translateY: "0px",
        opacity: 1,
        duration: 1,
        delay: 1,
        ease: "expo",
      }
    ),
    gsap.fromTo(
      n,
      { translateY: "400px", opacity: 0 },
      { translateY: "0px", opacity: 1, duration: 2, delay: 0.5, ease: "expo" }
    ),
    gsap.fromTo(e, { opacity: 0 }, { opacity: 1, duration: 2, delay: 1.5 }),
    window.addEventListener(
      "scroll",
      throttle(function () {
        const e = window.pageYOffset,
          t = document.querySelector(".collection-page-intro__bg-logo"),
          o = document.querySelector(".collection-page-intro__pers");
        (o.style.transform = "translateY(" + 0.1 * -e + "px)"),
          (t.style.transform = "translateY(" + 0.1 * e + "px)");
      }, 14)
    );
}
$authorPhotos.forEach((e, t) => {
  anim(e, "fadeInRight", t / 2);
}),
  document.querySelectorAll("a.a-scroll").forEach((e) => {
    e.addEventListener("click", function (e) {
      e.preventDefault(),
        document
          .querySelector(this.getAttribute("href"))
          .scrollIntoView({ behavior: "smooth" });
    });
  }),
  document.querySelector(".intro-t") && introAnimation(),
  document.querySelector(".page-kraft") && pageKraft(),
  document.querySelector(".page-odintri") && pageOdintri(),
  document.querySelector(".page-golopolosov") && pageGolopolosov(),
  document.querySelector(".collection-page-intro__pers") &&
    CollectionIntroAnimation();
const translateData = {
    ru: {
      MENU_COLLECTIONS: "Коллекции",
      MENU_MARKETPLACE: "Маркетплейс",
      MENU_WHITEPAPER: "White Paper",
      MENU_PRESALE: "Pre-Sale",
      HOME_META_TITLE: "NFTOPIUM | NFT Маркетплейс",
      HOME_TITLE:
        "Место, где артисты могут сделать больше, чем просто дропнуть свои работы",
      VIEW_COLLECTIONS: "Смотреть коллекции",
      KRAFT_META_TITLE: "NFTOPIUM | Ульяна Крафт",
      KRAFT_META_DESCRIPTION: "",
      KRAFT_NAME: "Ульяна Крафт",
      KRAFT_DESCR:
        "<p>«Искусство для меня неотъемлемая часть жизни. Оно в любом его проявлении помогает познать взглянуть на мир глазами другого человека который создал арт.  Любой вид искусства — интеллектуальный или декоративный — подталкивает к размышлениям, развивает воображение и насмотренность.  Очень рада, что в наше время творческие люди выходят на новый уровень и  делают крутые проекты не только в реальном, но и в виртуальном мире!»</p>",
      KRAFT_FEATURE_W_T_1: "Работала с Алек Монополи",
      KRAFT_FEATURE_W_T_2: "Презентовала свою картину Леонелю Месси",
      KRAFT_FEATURE_W_T_3: "Best Artist 2019",
      TKACH_META_TITLE: "NFTOPIUM | Артём Ткач",
      TKACH_META_DESCRIPTION: "",
      TKACH_NAME: "Артём Ткач",
      TKACH_POSITION: "Диджитал-художник",
      TKACH_ABOUT:
        "<p>Участвовал в фестивале современных этнических искусств «Стереотипы будущего» в качестве арт-директора, и выставлял свой интерактивный AR-арт в музее стрит-арта в Санкт-Петербурге, в ноябре 2019 года.<br>Делал AR-проект для совместной выставки Эрмитажа и Британского Музея, первой в истории России выставки искусства древней Ассирии —  ”Я воздвиг там мой царский дворец”.</p><p>Продвинул NFT-сообщество России в международном NFT пространстве, повысил узнаваемость российских диджитал-художников. Придумал и организовал первую в СНГ NFT-коллаборацию 42-х художников, итоговое полотно которой было продано за 8,4 ETH (≈30,000 $).</p><p>Выставлял свой NFT-арт на выставке проекта SOVRISK #напотоке в Подземом музее “Зарядья”.</p><p>Является одним из администраторов крупнейшего в СНГ сообщества CG-специалистов “Adobe After Effects”. Активно участвует в формировании и развитии комьюнити диджитал-художников, как информационно, так и финансово оказываю поддержку начинающим художникам.</p>",
      TKACH_WORK_1_TITLE: "WHO ARE YOU?",
      TKACH_WORK_1_DESCR:
        "«Скрывая лицо за маской из букв, утопая в уверенных отрезках кисти как в памяти, где прошлое в вечном конфликте с будущем»",
      TKACH_WORK_1_TXT:
        "<p>Красота - понятие относительное. Но есть правила и законы которыми можно управлять: гармония цвета, композиция, её ритм и динамика.</p><p>Световые волны сами по себе не имеют цвета. Цвет возникает лишь при восприятии этих волн человеческим глазом и мозгом.</p><p>Говоря о цветовой гармонии люди полагаются на субъективные чувства, в то время как понятие цветовой гармонии является объективной закономерностью.</p>",
      TKACH_WORK_2_TITLE: "Minotaur",
      TKACH_WORK_2_TXT:
        "<p>«Лабиринт – это символ мозга. Минотавр – животная часть ума, а Тесей – человеческая. Животная часть сильнее, но человеческая побеждает в конечном счете. В этом и заключается смысл истории эволюции.</p><p>Может быть, в этом все дело. Не думать, где выход, а понять, что жизнь – это распутье, на котором ты стоишь прямо сейчас. Тогда и лабиринт исчезнет – ведь целиком он существует только у нас в уме, а в реальности есть только простой выбор – куда дальше.»</p>",
      TKACH_WORK_3_TITLE: "Darkness",
      TKACH_WORK_3_TXT:
        "<p>«Если ты оказался в темноте и видишь хотя бы самый слабый луч света, ты должен идти к нему, вместо того, чтобы рассуждать, имеет смысл это делать или нет.<br>Может, это действительно не имеет смысла. Но просто сидеть в темноте не имеет смысла в любом случае.»</p>",
      ODINTRI_DESCR:
        "<p>ODINTRI долгое время занимался графическим дизайном, постиг искусство каллиграфии и леттеринга и со временем стал ярким представителем направления каллиграффити.</p>\n        <p>Маэстро работает с латинскими буквами, кириллицей и даже арабской вязью! Помимо Москвы и Петербурга, Руслан отметился своими работами в Барселоне и Дубаи.</p>\n        <p>Это тот случай, когда человек не пишет холсты, а проживает их: ODINTRI находится в режиме постоянного самосовершенствования, увлекается точными науками и, честно говоря, поражает нас симбиозом своей жизненной философии и самореализации в искусстве.</p>",
      ODINTRI_WORK_WITH: "Работал с:",
      LAMONOV_META_TITLE: "NFTOPIUM | Дмитрий Ламонов",
      LAMONOV_META_DESCRIPTION: "",
      LAMONOV_ABOUT:
        "<p>Дмитрий Ламонов — российский современный художник, специализирующийся на работе со шрифтами. Типографика является лейтмотивом почти всех его работ. Акцент в творчестве сделан на работу с древнерусской письменностью. В своих работах основывается на каноническом строении древнерусских букв, переосмысливая их в новом свете и раскрывая в разных темах и формах. Дмитрий Ламонов родился в 1987 году Ленинграде, с 2014 года живет и работает в Москве. Занимается графическим дизайном и современным искусством. Обладатель международных наград в области шрифтового дизайна. Работы были представлены на различных выставках в России и за рубежом. Международная выставка каллиграфии в Москве (2017), Каллиграфическое биеннале в Шардже, ОАЭ (2018).</p>",
      LAMONOV_WORK_1_TITLE: "Сингулярность",
      LAMONOV_WORK_1_TXT:
        '<p>Работа из серии, в которой совмещаются каллиграфия и иллюзии. В работе представлен образ черной дыры, поглащающей солнечный свет.<br>Текст: "Красное солнышко на белом свете черную землю греет".</p>',
      LAMONOV_WORK_2_TITLE: "Сладкий плакат",
      LAMONOV_WORK_2_TXT:
        "<p>Работа представляет из себя постер, буквы которого ассоциируются со сладким. Глядя на картинку, в организме активируется гормон счастья, подобно тому, когда мы съедаем что-то сладкое.</p>",
      LAMONOV_WORK_3_TITLE: "Пять элементов",
      LAMONOV_WORK_3_TXT:
        "<p>Работа представляет из себя анимацию из пяти холстов, объединенных в один. Работы были созданы специально для каллиграфического биеннале в Шардже в 2018 году и посвящены пяти элементам - огню, воде, земле, воздуху и квинтэссенции.</p>",
      LAMONOV_WORK_4_TITLE: "Санкт-Петербург",
      LAMONOV_WORK_4_TXT:
        "<p>Работа посвящена Санкт-Петербургу. Обыграно устойчивое мнение о том, что Питер - столица дождей. В композиции отображен тяжелый пласт дождей, накрывающих город. В дождевых потоках, вырывающихся из каждой тучи, написан свой вид дождя. В роли символа города изображена Петропавловская крепость.</p>",
      LAMONOV_WORK_5_TITLE: "Кириллическая коллекция 2.0",
      LAMONOV_WORK_5_TXT:
        "<p>Серия экспериментальных каллиграфических работ, в которых исследовалось разнообразие шрифтовых композиций, которые можно получить с использованием букв на основе древнеславянской письменности.</p>",
      GOLOPOLOSOV_META_TITLE: "NFTOPIUM | Егор Голополосов",
      GOLOPOLOSOV_META_DESCRIPTION: "",
      GOLOPOLOSOV_DESCR:
        "<p>За свою карьеру Егор начал в дизайне после ушел в иллюстрацию. В процессе сформировал свой собственный неповторимый стиль!</p>\n        <p>За свою карьеру успел поработать с крупными международными брендами и музыкантами. Сейчас активно продвигается на АРТ рынке - подписал контракт с галереей в AOЭ и с Американской NFT галереей!</p>\n        <p>Также Егор ведёт авторские youtube проекты. Одним из них является PINOK подкаст - подкаст про визуальную культуру и людей которые её создают!</p>",
      WP_META_TITLE: "NFTOPIUM | White Paper",
      WP_TITLE: "White Paper",
      WP_INTRO_TITLE:
        "Мы создали NFTOPIUM - NFT маркетплейс <br>на Binance Smart Chain и теперь:",
      WP_INTRO_TXT:
        '<p class="color-primary">комиссии за транзакции в разы дешевле;<br>любые операции с вашими NFT быстрее;<br>коллекционирование еще выгоднее</p><p>BSC имеет техническую совместимость с EVM, поэтому вы можете не беспокоится о том, что ваши NFT будут изолированы от существующих приложений или коллекций, построенных на Ethereum. Напротив, многие проекты и разработчики сегодня выбирают BSC, как достойную альтернативу, чтобы в будущем объединять NFT инновации из разных блокчейнов в единых вариациях приложений, ограниченных только фантазией пользователей, когда сеть Ethereum станет достаточно зрелой.</p><p>NFTOPIUM - это удобное место для поиска и демонстрации творческих работ, а также комфортный дом для лучших мировых профессионалов дизайна. Одновременно NFTOPIUM - это общественная торговая площадка для NFT. Создавайте, продавайте или собирайте цифровые товары, защищенные блокчейном.</p>',
      WP_STRUCTURE_TITLE: "Структура WP",
      WP_STRUCTURE_LIST:
        "<li>Токен циркуляции (QAS)</li>\n        <li>Токен управления (QUO)</li>\n        <li>Создание и оборот NFT на маркетплэйс</li>\n        <li>Пул ликвидности</li>\n        <li>NFTOPIUM DAO</li>\n        <li>NFTOPIUM Fund</li>\n        <li>Личный кабинет пользователя</li>\n        <li>Ответы на вопросы</li>",
      WP_CIRCULATION_TITLE: "Токен циркуляции QAS",
      WP_CIRCULATION_CONTENT:
        "<p>QAS - токен циркуляции или кровеносная система NFTOPIUM. Функции:</p>\n          <ul>\n            <li>оплата NFT;</li>\n            <li>фарминг в пуле ликвидности;</li>\n            <li>вознаграждение за рекомендации</li>\n          </ul>",
      WP_DISTRIBUTION_TITLE: "Распределение",
      WP_DISTRIBUTION_CONTENT_1:
        "<p>1. MAX Supply: 2 000 000 000 QAS</p>\n      <p>2. Пресейл до запуска маркетплейса: 500,000,000 QAS</p>\n      <p>Цель - развитие маркетплейса NFTOPIUM и запуск NFTOPIUM DAO. Проводится с продающего сайта со счетчиком до запуска маркетплэйса</p>\n      <p>Старт продаж с $0.01. Продолжительность 720 часов <br>Повышение с $0.01 до $0.09 каждые 80 часов по $0.01</p>\n      <p>Минимальный лот - $ 50</p>\n      <p>По каждой цене участники смогут приобрести не боле 55,555,555.6 QAS даже если время до очередного повышения не истекло</p>\n      <p>Нераспроданные в период пресейла QAS сжигаются.</p>\n      <p>Распределение средств, собранных на пресейле осуществляется смарт-контрактом и данные доступны публично (max сбор средств может составить до $25 000 000):</p>",
      WP_LiQUIDITY_POOLS: "пулы ликвидности;",
      WP_MARKETING_1:
        "маркетинг (в том числе 20% программа рекомендаций NFTOPIUM Presale",
      WP_DEVELOPMENT: "разработка;",
      WP_DAO: "NFTOPIUM DAO;",
      WP_TEAM: "команда.",
      WP_DISTRIBUTION_CONTENT_2:
        "<p>Срок заморозки токенов 182 дня с момента запуска пула ликвидности QAS/USDT (BEP-20) с поэтапной разморозкой по 1/182 части ежедневно.</p>\n        <p>3. Сэйл в момент запуска маркетплейса: 500 000 000 QAS. <br>Основная цель - формирование NFTOPIUM Fund.</p>\n        <p>Старт продаж с $0.10 Продажа проводится уже с сайта маркетплейса после его запуска и при условии, что участник активировал личный кабинет привязкой уникального кошелька и пополнил баланс.</p>\n        <p>Продолжительность 2160 часов, повышение с $0.10 до $0.90 каждые 240 часов по $0.10. Счетчик на сайте.</p>\n        <p>По каждой цене также доступно не более 55 555 555,6 QAS даже если время до очередного повышения не истекло.</p>\n        <p>Нераспроданные в период сейла QAS сжигаются.</p>\n        <p>Распределение средств, собранных на сейле осуществляется смарт-контрактом (max сбор средств может составить до $250 000 000):</p>",
      WP_FUND: "NFTOPIUM Fund;",
      WP_MARKETING_2:
        "маркетинг (в том числе 10% программа рекомендаций NFTOPIUM Sale)",
      WP_RESERVE: "резервный фонд NFTOPIUM DAO;",
      WP_DISTRIBUTION_CONTENT_3:
        "<p>Срок заморозки токенов 90 дней с момента запуска пула ликвидности QAS/USDT (BEP-20) с поэтапной разморозкой по 1/90 части ежедневно</p>\n      <p>После завершения сейла на маркетплейсе активируется пул ликвидности с основной парой QAS/USDT (BEP-20) и AMMM (automatic multi market maker), с помощью которых QAS свободно торгуется. До того момента за QAS возможно только продавать и покупать NFT на маркетплэйсе и размещать их на фарминг в паре с USDT.</p>\n      <p>4. Первые 100 000 создателей NFT: получают 100 000 QAS (после создания первого NFT на маркетплейсе и выставлении его на аукцион). Еще 100 000 QAS получают первые 100 000 создателей, чьи NFT куплены за QAS. В обоих случаях разово по 1 QAS с поздравительным оповещением в личном кабинете.</p>\n      <p>5. Программы рекомендаций. Бонусация 100 000 000 QAS.</p>\n      <p>Чтобы стимулировать HODL токенов QAS на начальном этапе у активных участников NFTOPIUM Community, мы создали программу рекомендаций на время проведения этапов Pre Sale и Sale, по которой вы получаете 10% от сумм оплаты QAS лично приглашенными вами инвесторами и зарабатываете живые деньги уже на раннем этапе развития NFTOPIUM. Порекомендуйте участие в NFTOPIUM Presale либо в NFTOPIUM Sale с помощью вашей личной ссылки, чтобы получать прибыль здесь и сейчас.</p>\n      <p>Когда пользователь инвестирует средства в QAS, то 10% суммы его оплаты предоставляется рекомендателю в качестве поощрения. При этом он получает +10% бонуса в токенах QAS (от суммы его оплаты). Таким образом 100% инвестиции конвертируются в QAS.</p>\n      <p>Если пользователь регистрируется напрямую на сайте без партнерской ссылки, то оказывается в корневой маркетинговой структуре. Средства, поступающие в корневую маркетинговую структуру направляются на Promo и PR NFTOPIUM Presale либо NFTOPIUM Sale. Излишки по завершение двух раундов финансирования распределяются на усмотрение команды в том числе остаток от 100 000 000 QAS, предназначенных для бонусации. Предварительно: этот остаток будет сожжен.</p>\n      <p>6. 250 000 000 QAS на развитие NFTOPIUM DAO и в пулы ликвидности</p>\n      <p>В пулы ликвидности QAS добавляются в количестве, зависимом от результатов Presale и Sale, а также в пропорции к другим активам в парах по формуле: % сбора в эквиваленте доллара США (30% и 15% соответственно из расчета, приведенного выше) / количество токенов QAS ( до 83 333 333,3 + до 41 666 666,7) = $1 за 1 QAS.</p>\n      <p>То есть в DAO: 125 000 000 QAS для обеспечения ликвидности в пулах, и 125 000 000 QAS на вознаграждения участников сообщества за вклады в развитие DAO, в том числе PR и Маркетинг и на развития self governance.</p>\n      <p>7. 599 800 000 QAS принадлежат команде, как контрольный пакет компании и остаются замороженными до момента полной автономии NFTOPIUM DAO. Ключевым показателем для этого будет является общая оценка NFTOPIUM Fund не менее $550 000 000.</p>\n      <p>При достижении указанного показателя вся сумма, а именно 599 800 000 QAS размораживается и распределяется:</p>",
      WP_QAS_1: "переходит в резервный фонд NFTOPIUM DAO;",
      WP_QAS_2: "пополняет NFTOPIUM FUND;",
      WP_QAS_3: "распределяются внутри команды;",
      WP_QAS_4:
        "поступает в распоряжение NFTOPIUM DAO на развитие и содержание",
      WP_DISTRIBUTION_CONTENT_4:
        "<p>Токен QAS после завершения 2 раундов финансирования возможно будет приобретать и продавать не только в пуле ликвидности маркетплейса NFTOPIUM, но и на сторонних площадках по ценам, отображающим спрос и предложение свободного рынка.</p>",
      WP_MANAGEMENT_TOKEN_TITLE: "Токен управления QUO",
      WP_MANAGEMENT_TOKEN_INTRO:
        "<p>Токен управления позволяет его владельцам, разместившим его на стейкинг:</p>\n          <ul>\n            <li>Предлагать изменения в рамках NFTOPIUM DAO;</li>\n            <li>Голосовать за принятие/отклонение изменений в рамках NFTOPIUM DAO;</li>\n            <li>Получать пассивную прибыль в QAS со всех продаж и покупок NFT.</li>\n          </ul>",
      WP_MANAGEMENT_TOKEN_CONTENT:
        '<p>Всего будет эмитировано 25 000 000 QUO (MAX Supply).<br>QUO невозможно приобрести, его возможно только заработать за фарминг QAS в паре с USDT (BEP-20) в пуле ликвидности.</p>\n      <p>Протокол NFTOPIUM DAO построен на BSC и генерирует новый блок каждые 3-5 секунд.<br>При этом эмитируется 1,3212 QUO и распределяется среди фермеров, пропорционально долям, предоставленной ими пулу ликвидности. В сутки майнится и распределяется приблизительно 22 830 QUO (в зависимости от функционирования BSC). Таким образом фарминг управляющих токенов QUO продлиться приблизительно 3 года со дня запуска протокола NFTOPIUM DAO.</p>\n      <p>Держатели QUO могут застейкать их и:<br>1. Получать пассивный доход (в QAS) в размере 0,2% от всех покупок и продаж NFT на маркетплейсе NFTOPIUM; <br>2. Получать до 0,4% (в QAS) от всех продаж NFT за рекомендации стейкинга QUO, пропорционально объему стейков на 5 уровнях в глубину маркетинговой структуры из расчета:</p>\n      <ul class="no-list-style padding-left">\n        <li><strong>1 уровень</strong> - 0,1% от объема стейка, пропорционально общей массе стейков на всех первых уровнях маркетинговой структуры. Аналогично, как считается пропорциональность личных стейков;</li>\n        <li><strong>2 уровень</strong> - 0.1% 0,1% от объема стейка, пропорционально общей массе стейков на всех вторых уровнях маркетинговой структуры. Аналогично, как считается пропорциональность личных стейков;</li>\n        <li><strong>3 уровень</strong> - 0.1% - || -</li>\n        <li><strong>4 уровень</strong> - 0.07% - || -</li>\n        <li><strong>5 уровень</strong> - 0.03% - || -</li>\n      </ul>\n      <p>3. Участвовать в управлении DAO, имея любого размера стейки <br>QUO Токен управления QUO недоступен для конвертации в пуле ликвидности NFTOPIUM. Его держатели могут свободно продавать его на сторонних площадках по ценам, отображающим спрос и предложение свободного рынка.</p>',
      WP_CRT_CIRLCON_TITLE: "Создание и оборот NFT на маркетплейсе NFTOPIUM",
      WP_CRT_CIRLCON_CONTENT:
        "<p>Для того, чтобы создать ваш NFT и добавить его на маркетплейс, не нужно обладать техническими навыками. Вы занимаетесь творчеством и воплощением своих идей, а мы берем на себя все остальное.<br>Процесс создания NFT или токенизации добавляемых вами объектов называется чеканка. Вам достаточно задать несколько параметров и NFT готов.</p>\n        <p>Выполните шаги:</p>\n        <p><strong>1. Выберете стандарт создаваемого NFT</strong></p>",
      WP_CRT_CIRLCON_C_1_T: "Стандарт",
      WP_CRT_CIRLCON_C_2_T: "Характеристика",
      WP_CRT_CIRLCON_C_3_T: "Примеры",
      WP_CRT_CIRLCON_C_2_R_1:
        "Невзаимозаменяемые <br>(токен в единственном экземпляре)",
      WP_CRT_CIRLCON_C_3_R_1:
        "Уникальные игровые предметы или персонажи. Уникальные цифровые произведения искусства. Др. объекты. Ничего похожего с вашим NFT в мире точно не существует.",
      WP_CRT_CIRLCON_C_2_R_2:
        "Частично-взаимозаменяемые<br>(токен в нескольких экземплярах",
      WP_CRT_CIRLCON_C_3_R_2:
        "Одинаковые игровые предметы или персонажи. Копии цифровых произведений искусства. Дубликаты. Вы можете выпустить ваш NFT в ограниченном количестве копий и отправить несколько копий одной транзакцией",
      WP_CRT_CIRLCON_C_2_R_3: "Составные <br>(токен владеет другими токенами",
      WP_CRT_CIRLCON_C_3_R_3:
        "Уникальный игровой персонаж, владеющий уникальными и одинаковыми игровыми предметами, а также цифровыми произведениями искусства. Уникальный игровой персонаж, владеющий депозитом в DeFi приложении. Этот NFT может владеть первыми двумя или любыми крипто активами, например BTC, ETH и USDT",
      WP_CRT_CIRLCON_CONTENT_2:
        '<p>Если вы не выбрали этот параметр, то по умолчанию ваш NFT будет отчеканен в стандарте BEP-721. Не волнуйтесь, если с первого раза у вас что-то пошло не так, как вы планировали. Вы всегда можете сжечь добавленные вами NFT, пока являетесь их единоличным владельцем, и отчеканить новые. Учитывайте, что при создании и сжигании NFT с баланса вашего кошелька будет списываться комиссия за размещение мета данных, создание NFT и транзакцию. Она в разы ниже комиссий блокчейна Ethereum, поэтому для вас пользоваться Q NFT уже гораздо выгоднее. Не забывайте держать на балансе вашего кошелька немного BNB для комисси.</p>\n        <p><strong>Загрузите объект в допустимом формате и, при желании, добавьте к нему превью.</strong></p>\n        <p>Например, если вы токенизируете аудио, то в качестве превью можете добавить для него обложку. Также вы можете добавить разблокируемый контент, который будет доступен только владельцам NFT.</p>\n        <p><strong>3. Далее кратко текстом введите имя вашего NFT в поле Название, а также при желании опишите его развернутую концепцию в поле Подробнее.</strong> </p>\n        <p><strong>4. Нажмите кнопку Чеканить и подтвердите транзакцию. После завершения процесса вам NFT будет создан и отобразиться в вашем личном кабинете. После чего пора познакомить с ним весь мир, для этого выберете один из четырех способов:</strong> </p>\n        <ol class="list-style-bracket">\n          <li><strong>Опубликуйте его в разделе Частная коллекция.</strong> После публикации другие пользователи смогут увидеть NFT, которым вы владеете и оценить его по 10 - бальной шкале. Для этого на маркетплейсе существует раздел Частные коллекции;</li>\n          <li><strong>Выставьте ваш NFT на торги способом прямой продажи, либо шардируйте и предложите другим пользователям приобрести его доли.</strong> Изменить цену возможно в любое время без транзакционных издержек через подачу заявки на подпись через свой кошелек</li>\n          <li><strong>Выставьте ваш NFT на торги с помощью аукциона,</strong> предоставив возможность оценить его по достоинству и сформировать рыночную цену другим пользователям NFTOPIUM - участникам аукциона;</li>\n          <li><strong>Подарите ваш NFT,</strong> его долю или коллекцию другому пользователю, красиво оформив знак вашего внимания с помощью сервиса маркетплейса Подарки.</li>\n        </ol>\n        <p>В разделе Частная коллекция вы можете публиковать как отдельные NFT, так и собранные вами коллекции, которые могут состоять из NFT и шардов. Шард NFT - это токен, который является долей целого nft. Токенизация nft называется шардирование. Концепции ваших коллекций ограничены только вашим воображением.</p>\n        <p>Когда вы создали коллекцию, вы можете токенизировать ее прямо на маркетплейсе и публично (либо приватно) предложить другим пользователям маркетплэйса приобрести доли вашей коллекции, либо приобрести выпущенные вами управляющие токены коллекции и создать таким образом DAO коллекции, где держатели управляющих токенов могут предлагать изменения и голосовать за них. Третий вариант - создать собственный индекс NFT, выпустив его токен в обращение. Во всех случаях простым рыночным механизмом, регулирующим стоимость выпущенных вами токенов будет текущая капитализация вашей коллекции поделенная на количество токенов, находящихся в обороте.</p>\n        <p>Прежде чем выставить ваш NFT на торги, задайте параметры комиссий:</p>\n        <ol class="list-style-bracket">\n          <li><strong>если вы создатель,</strong> то вы можете заложить постоянную роялти от 0% до 51%. При этом с каждой перепродажей созданного вами NFT вы будете получать соответствующее вознаграждение от сумм всех повторных покупок. Возможно установить роялти на ограниченное количество перепродаж.</li>\n          <li><strong>если вы коллекционер,</strong> а также являетесь опытным ценителем, подобно признанным цензорам, к мнению которых склонно прислушиваться общество, и владеете приобретенными NFT на 100% (не долями), то вы можете установить комиссии на следующие перепродажи этого NFT от 0% до 5%. Это вознаграждение за ваш труд по поиску, отбору наиболее выдающихся NFT и презентацию их миру. Для получения подобной комиссии необязательно владеть NFT. Если создатель согласен установить данную комиссию в вашу пользу в качестве благодарности за продвижение создаваемых им NFT, то это возможно.</li>\n        </ol>\n        <p>Цены на маркетплейсе отображаются в эквиваленте доллара США.</p>',
      WP_FEES_TITLE: "Комиссии маркетплейса NFTOPIUM",
      WP_FEES_CONTENT:
        '<p>Общая комиссия с оборота NFT и их производных на маркетплейсе составляет всего 2%, при этом 50% от нее распределяется среди пользователей маркетплейса NFTOPIUM.<br>Как это работает?</p>\n      <p><strong>1. Постоянная роялти маркетплэйса составляет 1% (со всех продаж).</strong> Из которых:</p>\n      <ul class="list-style-dash">\n        <li>0.5% принадлежит маркетплейсу.</li>\n        <li>0.1% - пользователям, которые поддерживают базу данных (метаданных для nft) маркетплэйса на своих мощностях (нода) и заморозили стейкинге для подтверждения своей вовлечённости N количество токенов QOU, а также тем, кто застейкал свои токены QUO в пользу этих узлов, чтобы те могли голосовать вместо них и участвовать в развитии маркетплейса.</li>\n        <li>Оставшиеся 0,4% распределяются в программу рекомендаций поддержки и развития</li>\n      </ul>\n      <p>NFTOPIUM DAO. То есть участникам NFTOPIUM сообщества, у которых в маркетинговой структуре кто-либо застейкал токены QUO. Вознаграждение распределяется на 5 уровней по:</p>\n      <ul class="no-list-style padding-left">\n        <li><strong>1 уровень</strong> - 0,1% от объема стейка, пропорционально общей массе стейков на всех первых уровнях маркетинговой структуры. Аналогично, как считается пропорциональность личных стейков.</li>\n        <li><strong>2 уровень</strong> - 0,1% от объема стейка, пропорционально общей массе стейков на всех вторых уровнях маркетинговой структуры. Аналогично, как считается пропорциональность личных стейков.</li>\n        <li><strong>3 уровень</strong> - 0,1% - || -</li>\n        <li><strong>4 уровень</strong> - 0,07% - || -</li>\n        <li><strong>5 уровень</strong> - 0,03% - || -</li>\n      </ul>\n      <p><strong>2. Постоянная комиссия маркетплейса со всех покупок составляет 1% (подобно роялти с продаж).</strong> Из которых:</p>\n      <ul class="list-style-dash">\n        <li>0,5% принадлежит маркетплейсу.</li>\n        <li>0,1% - пользователям, которые поддерживают базу данных (метаданных для nft) маркетплэйса на своих мощностях (нода) и заморозили стекинге для подтверждения своей вовлечённости N количество токенов QOU, а также те, кто застейкал (заморозил) свои токены QUO в пользу этих узлов, чтобы те могли голосовать вместо них и участвовать в развитии маркетплейса</li>\n        <li>Оставшиеся 0,4% распределяются в программу рекомендаций покупателям. То есть участникам NFTOPIUM сообщества, у которых в маркетинговой структуре кто-либо покупает NFT или их производные на платформе NFTOPIUM. Вознаграждение распределяется на 5 уровней по:</li>\n      </ul>\n      <ul class="no-list-style padding-left">\n        <li><strong>1 уровень</strong> - 0.1% от суммы покупки</li>\n        <li><strong>2 уровень</strong> - 0,1% - || -</li>\n        <li><strong>3 уровень</strong> - 0,1% - || -</li>\n        <li><strong>4 уровень</strong> - 0,07% - || -</li>\n        <li><strong>5 уровень</strong> - 0,03% - || -</li>\n      </ul>\n      <p>Вознаграждения по данным программам рекомендаций начисляются смарт-контрактом в токенах QAS один раз в сутки для оптимизации транзакционных издержек. Продавец просто получает на 2% меньше цены, которую оплатил покупатель. Цена для покупателя показана сразу с учетом этих 2%, поэтому в сущности пользователи могут не отвлекаться от своих творческих активностей, но при этом постоянно зарабатывать на них. Это еще не все, имея свою коллекцию, вы можете создать собственный индекс.</p>',
      WP_LQDT_POOL_TITLE: "Пул ликвидности",
      WP_LQDT_POOL_CONTENT:
        "<p>Пул ликвидности NFTOPIUM - это протокол для конвертации крипто активов в токен QAS и обратно, который является частью маркетплейса NFTOPIUM.</p>\n        <p>Представляет собой automatic multi market maker (AMMM) по примеру подобных протоколов, существующих сегодня на блокчейне Ethereum.</p>\n        <p>Основной парой пула ликвидности является QAS (BEP-20) к USDT (BEP-20). При этом, если пользователь хочет обменять один из поддерживаемых BSC крипто активов стандарта BEP-20, то протокол создает многоуровневую конвертацию. К примеру: BTCB-USDT-QAS.</p>\n        <p>Добавить (либо извлечь) ликвидность в пул для фарминга QUO возможно только добавляя пару QAS / USDT (BEP-20) в соотношении цены токена на текущий момент.</p>\n        <p>За прямую конвертацию QAS / USDT и USDT / QAS помимо транзакционных издержек сети BSC протокол взимает комиссию 0,3% и распределяет ее среди поставщиков ликвидности, имеющих токены поставщика ликвидности.</p>",
      WP_DAO_TITLE: "NFTOPIUM DAO",
      WP_DAO_CONTENT:
        '<p>Протокол на BSC, основной задачей которого является постепенное создание децентрализованной автономной организации независимых пользователей NFTOPIUM для управления маркетплейсом и его инфраструктурой, включающей протоколы пула ликвидности и NFTOPIUM Fund в формате self governance.</p>\n      <p>Показателем готовности NFTOPIUM DAO к полной автономии станет достижение капитализации NFTOPIUM Fund $550 000 000+. При этом, согласно п. 1, в протоколе NFTOPIUM DAO разморозятся средства, принадлежащие команде разработчиков и управление станет полностью независимым от изначальной команды.</p>\n      <p>Стать участником NFTOPIUM DAO может любой пользователь, если имеет личный стейк в токенах QUO, при этом уровень репутации и значимости голоса участника DAO зависит от факторов:</p>\n      <ul class="list-style-dash">\n        <li>наличия ноды, поддерживающей цепочку протокола NFTOPIUM DAO на BSC;</li>\n        <li>объем личного стейка;</li>\n        <li>объем структурного стейка;</li>\n        <li>личный кабинет, в котором прослеживается регулярная активность (операции не менее 1 раза в неделю);</li>\n        <li>послужной список выполненных задач, направленных на развитие NFTOPIUM DAO, который прозрачно доступен в разделе информации о DAO на маркетплейсе (разработка, маркетинг, PR, стратегическое развитие, другое).</li>\n      </ul>\n      <p>Участники NFTOPIUM DAO и любые другие пользователи NFTOPIUM вознаграждаются за выполнение задач, направленных на развитие DAO суммами QAS, решение о которых принимается голосованием участников NFTOPIUM DAO.</p>',
      WP_FUND_TITLE: "NFTOPIUM Fund",
      WP_FUND_CONTENT:
        "<p>Часть инфраструктуры протокола NFTOPIUM DAO, целью которой является создание коллекции NFT и шардов, а также капитала в иных крипто активах, общая капитализация которых превысит $550 000 000. Данная капитализация является неотъемлемой частью капитализации всей эмиссии токена QAS.</p>\n      <p>Для выполнения этой задачи участники NFTOPIUM DAO могут использовать любые эффективные способы на базе собственных пулов ликвидности, к примеру такие решения по некастодиальному портфельному менеджменту, как TokenSets. Его можно использовать в формате обеспечения токена QAS корзиной шардов. Эта корзина может быть как неизменной по составу, так и ребалансируемой. Смарт-контракт может 24/7 управлять портфелем шардов, которым он обеспечен: по стратегии, заданной алгоритмом (робо-сеты), или по стратегии избранного портфельного менеджера (публичные трейдерские сеты). При этом вы в любой момент можете погасить этот токен корзиной шардов, которой он обеспечен.</p>\n      <p>Возможны другие решения. Благо, мы с вами находимся на ранней стадии развития технологий и возможности ограничены только нашей фантазией.</p>",
      WP_ACCOUNT_TITLE: "Личный кабинет пользователя NFTOPIUM",
      WP_ACCOUNT_CONTENT:
        '<p>Для создания личного кабинета на маркетплейсе NFTOPIUM пользователю достаточно привязать личную электронную почту и любой кошелек, поддерживающий сеть BSC. <br>Это может быть Metamask или Trust Wallet.</p>\n        <p>В кабинете пользователя отображаются:</p>\n        <p><strong>Аватар</strong> (подписано сразу, он участник NFTOPIUM DAO или еще нет)</p>\n        <p><strong>Его имя,</strong> указанное при регистрации;</p>\n        <p><strong>Публичный адрес привязанного кошелька</strong> (с опцией по его замене);</p>\n        <p><strong>Баланс кошелька</strong></p>\n        <p><strong>Все его NFT</strong>, подразделенные на:</p>\n        <ul class="list-style-dash">\n          <li>личные;</li>\n          <li>публичные (те, которые выставил показать для всех пользователей) и количество лайков под ними;</li>\n          <li>коллекции NFT и шардов.</li>\n        </ul>\n        <p> <strong>Также показаны:</strong> </p>\n        <ul class="list-style-dash">\n          <li>доля в токенизированной коллекции (если имеет);</li>\n          <li>токены индексов и коллекций (которыми он владеет);</li>\n          <li>созданные им DAO коллекций, индексы.</li>\n        </ul>\n        <p> <strong>Отдельно выделены:</strong> </p>\n        <ul class="list-style-dash">\n          <li>его стейк в токенах QUO и сколько QAS он на этом заработал;</li>\n          <li>стейк его структуры в токенах QUO и сколько QAS он на этом заработал;</li>\n          <li>его доля в пуле ликвидности с детализацией количества QAS и USDT, а также сколько он на этом заработал;</li>\n          <li>количество активных покупателей на каждом из 5 уровней и сколько QAS он заработал комиссий за их активность.</li>\n        </ul>\n        <p> <strong>Статистика его активностей:</strong> </p>\n        <ol class="padding-left">\n          <li>Участие в текущих аукционах;</li>\n          <li>Размещенные на торгах NFT;</li>\n          <li>Купленные, проданные NFT и их производные;</li>\n          <li>Общая оценка стоимости его портфеля NFT и других активов;</li>\n          <li>Его рейтинги заемщика;</li>\n          <li>Его заслуги по выполнению задач, направленных на развитие NFTOPIUM DAO и вознаграждения за них.</li>\n        </ol>',
    },
    en: {
      MENU_COLLECTIONS: "Collections",
      MENU_MARKETPLACE: "Marketplace",
      MENU_WHITEPAPER: "White Paper",
      MENU_PRESALE: "Pre-Sale",
      HOME_META_TITLE: "NFTOPIUM | NFT Marketplace",
      HOME_TITLE: "A place where artists can do more than just drop their work",
      VIEW_COLLECTIONS: "View collections",
      KRAFT_META_TITLE: "NFTOPIUM | Ulyana Kraft",
      KRAFT_META_DESCRIPTION: "",
      KRAFT_NAME: "Ulyana Kraft",
      KRAFT_DESCR:
        "<p>«Art is an integral part of my life for me. It in any of its manifestations helps to learn to look at the world through the eyes of another person who created the art. Any kind of art - intellectual or decorative - stimulates thought, develops imagination and observation. I am very glad that nowadays creative people are reaching a new level and doing cool projects not only in the real, but also in the virtual world!»</p>",
      KRAFT_FEATURE_W_T_1: "Worked with Alec Monopoli",
      KRAFT_FEATURE_W_T_2: "I presented my painting to Leonel Messi",
      KRAFT_FEATURE_W_T_3: "Best Artist 2019",
      TKACH_META_TITLE: "NFTOPIUM | Artyom Tkach",
      TKACH_META_DESCRIPTION: "",
      TKACH_NAME: "Artyom Tkach",
      TKACH_POSITION: "Digital Artist",
      TKACH_ABOUT:
        '<p>Participated in the festival of contemporary ethnic arts "Stereotypes of the Future" as an art director, and exhibited his interactive AR-art at the Street Art Museum in St. Petersburg, in November 2019. <br> Made an AR-project for a joint exhibitions of the Hermitage and the British Museum, the first exhibition of the art of ancient Assyria in the history of Russia - “I erected my royal palace there.”</p><p>He promoted the NFT community of Russia in the international NFT space, increased the recognition of Russian digital artists. Invented and organized the first in the CIS NFT-collaboration of 42 artists, the final canvas of which was sold for 8.4 ETH (≈ $ 30,000).</p><p>Exhibited his NFT-art at the exhibition of the SOVRISK project #flood in Underground Zaryadye Museum.</p><p>He is one of the administrators of Adobe After Effects, the largest community of CG specialists in the CIS. Actively participates in the formation and development of the community of digital artists, both informationally and financially, I provide support to novice artists.</p>',
      TKACH_WORK_1_TITLE: "WHO ARE YOU?",
      TKACH_WORK_1_DESCR:
        '"Hiding his face behind a mask of letters, drowning in confident brush sections as in memory, where the past is in eternal conflict with the future."',
      TKACH_WORK_1_TXT:
        "<p>Beauty is a relative concept. But there are rules and laws that can be controlled: harmony of color, composition, its rhythm and dynamics.</p><p>Light waves by themselves have no color. Color arises only when these waves are perceived by the human eye and the brain.</p><p>Speaking about color harmony, people rely on subjective feelings, while the concept of color harmony is an objective law.</p>",
      TKACH_WORK_2_TITLE: "Minotaur",
      TKACH_WORK_2_TXT:
        "<p>“The labyrinth is a symbol of the brain. The Minotaur is the animal part of the mind, and Theseus is the human part. The animal part is stronger, but the human part wins in the end. This is the meaning of the history of evolution.</p><p>Maybe this is the whole point. Not to think where the way out is, but to understand that life is a crossroads on which you are standing right now. Then the labyrinth will disappear - after all, it exists only in our minds, but in reality there is only a simple choice - where to go. ”</p>",
      TKACH_WORK_3_TITLE: "Darkness",
      TKACH_WORK_3_TXT:
        "<p>“If you find yourself in the dark and see at least the faintest ray of light, you should go to it, instead of reasoning whether it makes sense to do it or not. <br>Maybe it really doesn't make sense. But just sitting in the dark doesn't make sense anyway. ”</p>",
      ODINTRI_DESCR:
        "<p>ODINTRI has been engaged in graphic design for a long time, comprehended the art of calligraphy and lettering and eventually became a prominent representative of the calligraffiti trend.</p>\n        <p>Maestro works with Latin letters, Cyrillic and even Arabic script! In addition to Moscow and St. Petersburg, Ruslan distinguished himself with his works in Barcelona and Dubai.</p>\n        <p>This is the case when a person does not paint canvases, but lives them: ODINTRI is in a mode of constant self-improvement, is fond of the exact sciences and, frankly, amazes us with the symbiosis of his life philosophy and self-realization in art.</p>",
      ODINTRI_WORK_WITH: "Worked with:",
      LAMONOV_META_TITLE: "NFTOPIUM | Dmitry Lamonov",
      LAMONOV_META_DESCRIPTION: "",
      LAMONOV_ABOUT:
        "<p>Dmitry Lamonov is a Russian contemporary artist specializing in typefaces. Typography is the theme of nearly all of his work. The emphasis in creativity is placed on working with Old Russian writing. In his works, he is based on the canonical structure of Old Russian letters, rethinking them in a new light and revealing them in different themes and forms. Dmitry Lamonov was born in 1987 in Leningrad, and has been living and working in Moscow since 2014. He is engaged in graphic design and contemporary art. Winner of international awards in the field of type design. The works were presented at various exhibitions in Russia and abroad. International Exhibition of Calligraphy in Moscow (2017), Calligraphic Biennale in Sharjah, UAE (2018).</p>",
      LAMONOV_WORK_1_TITLE: "Singularity",
      LAMONOV_WORK_1_TXT:
        '<p>A work from a series that combines calligraphy and illusion. The work presents the image of a black hole absorbing sunlight. <br>Text: "A red sun on white light heats the black earth."</p>',
      LAMONOV_WORK_2_TITLE: "Sweet Poster",
      LAMONOV_WORK_2_TXT:
        "<p>The work is a poster, the letters of which are associated with sweet. Looking at the picture, the hormone of happiness is activated in the body, similar to when we eat something sweet.</p>",
      LAMONOV_WORK_3_TITLE: "Five elements",
      LAMONOV_WORK_3_TXT:
        "<p>The work is an animation of five canvases combined into one. The works were created specifically for the 2018 Sharjah Calligraphy Biennial and are dedicated to the five elements - fire, water, earth, air and quintessence.</p>",
      LAMONOV_WORK_4_TITLE: "Saint Petersburg",
      LAMONOV_WORK_4_TXT:
        "<p>The work is dedicated to St. Petersburg. The strong opinion that St. Petersburg is the capital of the rains has been played up. The composition depicts a heavy layer of rain covering the city. In the rain streams erupting from each cloud, a different kind of rain is written. The Peter and Paul Fortress is depicted as a symbol of the city.</p>",
      LAMONOV_WORK_5_TITLE: "Cyrillic collection 2.0",
      LAMONOV_WORK_5_TXT:
        "<p>A series of experimental calligraphic works that explored the variety of type compositions that can be obtained using letters based on ancient Slavic writing.</p>",
      GOLOPOLOSOV_META_TITLE: "NFTOPIUM | Egor Golopolosov",
      GOLOPOLOSOV_META_DESCRIPTION: "",
      GOLOPOLOSOV_DESCR:
        "<p>During his career, Yegor started in design and then moved on to illustration. In the process, he formed his own unique style!</p>\n        <p>During his career, he managed to work with major international brands and musicians. Now he is actively promoting on the ART market - he signed a contract with a gallery in the AOE and with the American NFT gallery!</p>\n        <p>Egor also leads author's youtube projects. One of them is PINOK podcast - a podcast about visual culture and the people who create it!</p>",
      WP_META_TITLE: "NFTOPIUM | White paper",
      WP_TITLE: "White Paper",
      WP_INTRO_TITLE:
        "We created NFTOPIUM - NFT marketplace <br> on Binance Smart Chain and now:",
      WP_INTRO_TXT:
        "<p class=\"color-primary\">transaction fees are several times cheaper;<br>any transactions with your NFTs are faster;<br>collecting is even more profitable.</p><p>The BSC is technically compatible with the EVM, so you don't have to worry about your NFTs being isolated from existing applications or collections built on Ethereum. On the contrary, many projects and developers today choose BSC as a worthy alternative in order to unite in the future NFT innovations from different blockchains in uniform application variations limited only by imagination users when the Ethereum network is mature enough.</p><p>NFTOPIUM is a convenient place to search and showcase creative works, as well as a comfortable home for the world's best design professionals. At the same time, NFTOPIUM is a public trading platform for NFT. Create, sell, or collect blockchain-protected digital goods.</p>",
      WP_STRUCTURE_TITLE: "WP structure",
      WP_STRUCTURE_LIST:
        "<li>Circulation Token (QAS)</li>\n        <li>Management Token (QUO)</li>\n        <li>Creation and circulation of NFT on the marketplace</li>\n        <li>Liquidity pool</li>\n        <li>NFTOPIUM DAO</li>\n        <li>NFTOPIUM Fund</li>\n        <li>User's personal account</li>\n        <li>Answers on questions</li>",
      WP_CIRCULATION_TITLE: "QAS circulation token",
      WP_CIRCULATION_CONTENT:
        "<p>QAS is the circulation token or circulatory system of NFTOPIUM. Functions</p>\n          <ul>\n            <li>NFT payment;</li>\n            <li>farming in the liquidity pool;</li>\n            <li>recommendation fee</li>\n          </ul>",
      WP_DISTRIBUTION_TITLE: "Distribution",
      WP_DISTRIBUTION_CONTENT_1:
        "<p>1. MAX Supply: 2 000 000 000 QAS</p>\n      <p>2. Pre-sale before the launch of the marketplace: 500,000,000 QAS</p>\n      <p>The goal is to develop the NFTOPIUM marketplace and launch the NFTOPIUM DAO. Conducted with the selling site with a counter before the launch of the marketplace.</p>\n      <p>Sales start at $ 0.01. Duration 720 hours<br>Increase from $ 0.01 to $ 0.09 every 80 hours at $ 0.01</p>\n      <p>Minimum lot - $ 50</p>\n      <p>At each price, members will be able to purchase a maximum of 55,555,555.6 QASeven if the time before the next promotion has not expired.</p>\n      <p>Unsold items during the QAS pre-sale period are burned.</p>\n      <p>The distribution of funds collected on the presale is carried out by a smart contract and data is publicly available (max fundraising can be up to $ 25,000,000):</p>",
      WP_LiQUIDITY_POOLS: "liquidity pools;",
      WP_MARKETING_1:
        "marketing (including 20% NFTOPIUM Presale recommendation program;",
      WP_DEVELOPMENT: "development;",
      WP_DAO: "NFTOPIUM DAO;",
      WP_TEAM: "team.",
      WP_DISTRIBUTION_CONTENT_2:
        "<p>The term for freezing tokens is 182 days from the launch of the QAS / USDT liquidity pool (BEP-20) with a phased unfreezing of 1/182 part daily.</p>\n        <p>3. Sale at the time of the launch of the marketplace: 500,000,000 QAS. <br>The main goal is the formation of the NFTOPIUM Fund.</p>\n        <p>Sales start from $ 0.10 The sale is carried out already from the marketplace website after its launch and provided that the participant has activated his personal account by linking a unique wallet and replenished the balance.</p>\n        <p>Duration 2160 hours, increasing from $ 0.10 to $ 0.90 every 240 hours at $ 0.10. Counter on the site.</p>\n        <p>For each price, no more than 55 555 555.6 QAS is also available, even if the time before the next increase has not expired.</p>\n        <p>Unsold items during the QAS sale period are burned.</p>\n        <p>The distribution of funds collected on the sale is carried out by a smart contract (max fundraising can be up to $ 250,000,000):</p>",
      WP_FUND: "NFTOPIUM Fund;",
      WP_MARKETING_2:
        "marketing (including 20% NFTOPIUM Presale recommendation program;",
      WP_RESERVE: "reserve fund NFTOPIUM DAO;",
      WP_DISTRIBUTION_CONTENT_3:
        "<p>The token freeze period is 90 days from the launch of the QAS / USDT liquidity pool (BEP-20) with a phased unfreeze of 1/90 of the daily.</p>\n      <p>After the sale is completed on the marketplace, a liquidity pool is activated with the main pair QAS / USDT (BEP-20) and AMMM (automatic multi market maker), with which QAS is freely traded. Until then, for QAS, it is only possible to sell and buy NFTs on the marketplace and place them on pharming paired with USDT.</p>\n      <p>4. The first 100,000 NFT creators: receive 100,000 QAS (after creating the first NFT on the marketplace and putting it up for auction). Another 100,000 QAS are received by the first 100,000 creators whose NFTs were purchased with QAS. In both cases, one-time 1 QAS with a congratulatory notification in your personal account.</p>\n      <p>5. Programs of recommendations. Bonus 100,000,000 QAS.</p>\n      <p>In order to stimulate HODL QAS tokens at the initial stage among active members of the NFTOPIUM Community, we have created a recommendation program during the Pre Sale and Sale stages, according to which you receive 10% of the QAS payments by your personally invited investors and earn real money already at an early stage of development. NFTOPIUM. Recommend participation in the NFTOPIUM Presale or the NFTOPIUM Sale using your personal link to make a profit here and now.</p>\n      <p>When a user invests in QAS, then 10% of the amount of his payment provided to the referrer as a reward. At the same time, he receives + 10% bonus in QAS tokens (from the amount paid). Thus 100% investment converted to QAS.</p>\n      <p>If the user registers directly on the site without an affiliate link, then finds itself in the root of the marketing structure. Funds entering the root the marketing structure is directed to Promo and PR NFTOPIUM Presale or NFTOPIUM Sale. Surplus at the end of two rounds of funding is apportioned at the discretion of the team, including the balance of 100,000,000 QAS intended for bonuses. Preliminary: this remnant will be burned.</p>\n      <p>6. 250 million QAS for the development of NFTOPIUM DAO and liquidity pools.</p>\n      <p>QAS liquidity pools are added in an amount depending on the results of Presale and Sale, as well as in proportion to other assets in pairs according to the formula:% of collection in equivalent USD (30% and 15%, respectively, from the calculation above) / amount QAS tokens (up to 83 333 333.3 + up to 41 666 666.7) = $ 1 for 1 QAS.</p>\n      <p>That is, in the DAO: 125 million QAS to provide liquidity in the pools, and 125 million QAS to reward community members for contributions to the development of the DAO, including PR and Marketing, and to the development of self governance.</p>\n      <p>7.599.8 million QAS is owned by the team as a majority stake in the company and remain frozen until the full autonomy of the NFTOPIUM DAO. The key indicator for this will be the overall assessment of the NFTOPIUM Fund at least $ 550,000,000.</p>\n      <p>Upon reaching the specified indicator, the entire amount, namely 599,800,000 QAS defrosted and distributed:</p>",
      WP_QAS_1: "transferred to the NFTOPIUM DAO reserve fund;",
      WP_QAS_2: "replenishes NFTOPIUM FUND;",
      WP_QAS_3: "distributed within the team;",
      WP_QAS_4:
        "becomes available to NFTOPIUM DAO for development and maintenance.",
      WP_DISTRIBUTION_CONTENT_4:
        "<p>QAS token after the completion of 2 rounds of funding will be possible to acquire and sell not only in the liquidity pool of the NFTOPIUM marketplace, but also on third-party sites at prices that reflect the supply and demand of the free market.</p>",
      WP_MANAGEMENT_TOKEN_TITLE: "QUO Management Token",
      WP_MANAGEMENT_TOKEN_INTRO:
        "<p>A management token allows its owners who have placed it on staking:</p>\n          <ul>\n            <li>Suggest changes within NFTOPIUM DAO;</li>\n            <li>Vote for acceptance / rejection of changes within the NFTOPIUM DAO;</li>\n            <li>Receive passive income in QAS from all NFT sales and purchases.</li>\n          </ul>",
      WP_MANAGEMENT_TOKEN_CONTENT:
        '<p>A total of 25,000,000 QUO (MAX Supply) will be issued.<br>QUO cannot be purchased, it can only be earned by farming QAS in tandem with USDT (BEP-20) in the liquidity pool.</p>\n      <p>The NFTOPIUM DAO protocol is built on BSC and generates a new block every 3-5 seconds.<br>At the same time, 1.3212 QUO is issued and distributed among farmers, proportionally shares provided by them to the liquidity pool. It is mined and distributed per day approximately 22,830 QUO (depending on BSC operation). In this way pharming of QUO management tokens will last approximately 3 years from the date of launch NFTOPIUM DAO protocol.</p>\n      <p>QUO holders can stake them and:<br>1. Receive passive income (in QAS) in the amount of 0.2% of all purchases and sales NFT on the NFTOPIUM marketplace; <br>2. Receive up to 0.4% (in QAS) of all NFT sales for staking recommendations QUO, proportional to the volume of steaks at 5 levels in depth of marketing structures from the calculation:</p>\n      <ul class="no-list-style padding-left">\n        <li><strong>Level 1</strong> - 0.1% of the steak volume, in proportion to the total weight of the steaks in all the first levels of the marketing structure. Similarly, as it is considered proportionality of personal steaks;</li>\n        <li><strong>Level 2</strong> - 0.1% of the steak volume, in proportion to the total weight of the steaks in all second levels of the marketing structure. Similarly, as it is considered proportionality of personal steaks</li>\n        <li><strong>Level 3</strong> - 0.1% - || -</li>\n        <li><strong>Level 4</strong> - 0.07% - || -</li>\n        <li><strong>Level 5</strong> - 0.03% - || -</li>\n      </ul>\n      <p>3. Participate in the management of the DAO, having any size of QUO steaks The QUO management token is not available for conversion in the NFTOPIUM liquidity pool. His holders can freely sell it on third-party sites at prices, showing the supply and demand of the free market.</p>',
      WP_CRT_CIRLCON_TITLE:
        "Creation and circulation of NFT on the NFTOPIUM marketplace",
      WP_CRT_CIRLCON_CONTENT:
        "<p>In order to create your NFT and add it to the marketplace, you do not need to have technical skills. You are engaged in creativity and embodiment of your ideas, and we we take care of the rest.<br>The process of creating an NFT or tokenizing the objects you add is called chasing. You just need to set a few parameters and the NFT is ready.</p>\n        <p>Follow the steps:</p>\n        <p><strong>1. Select the standard of the created NFT</strong></p>",
      WP_CRT_CIRLCON_C_1_T: "Standart",
      WP_CRT_CIRLCON_C_2_T: "Characteristic",
      WP_CRT_CIRLCON_C_3_T: "Examples",
      WP_CRT_CIRLCON_C_2_R_1: "Not Fungible <br>(token in a single copy)",
      WP_CRT_CIRLCON_C_3_R_1:
        "Unique in-game items or characters. Unique digital works of art. Dr. objects. Nothing like your NFT in the world definitely doesn't exist.",
      WP_CRT_CIRLCON_C_2_R_2:
        "Partially interchangeable <br>(token in multiple copies)",
      WP_CRT_CIRLCON_C_3_R_2:
        "The same in-game items or characters. Copies of digital works of art. Duplicates. You can release your NFT in limited number of copies and send multiple copies of one transaction",
      WP_CRT_CIRLCON_C_2_R_3: "Composite <br>(the token owns other tokens)",
      WP_CRT_CIRLCON_C_3_R_3:
        "Unique playable character, owning unique and the same game items, as well as digital works art. Unique gaming character who owns a deposit in DeFi application. This NFT can own the first two or any crypto assets such as BTC, ETH and USDT",
      WP_CRT_CIRLCON_CONTENT_2:
        '<p>If you have not selected this option, then by default your NFT will be minted in the standard BEP-721. Don\'t worry if something went wrong with you the first time. planned. You can always burn the NFTs you added while you are the sole owner, and minted new ones. Keep in mind that when creating and burning NFT, a commission for posting meta data will be deducted from your wallet balance, NFT creation and transaction. It is several times lower than the Ethereum blockchain fees, so for using Q NFT is already much more profitable. Remember to keep your wallet with a little BNB for commissions</p>\n        <p><strong>2. Load the object in a valid format and, if desired, add a preview to it.</strong> </p>\n        <p>For example, if you tokenize audio, then as a preview you can add for itcover. You can also add unlockable content that will be available only for NFT holders.</p>\n        <p><strong>3. Next, briefly enter the name of your NFT in the Name field, and, if desired, describe its detailed concept in the Details field.</strong> </p>\n        <p><strong>4. Click the Minute button and confirm the transaction. After the completion of the process you NFT will be created and displayed in your personal account. Then it\'s time to acquaint the whole world with him, for this you choose one of four ways:</strong> </p>\n        <ol class="list-style-bracket">\n          <li><strong>Publish it in the Private Collection section</strong> After publication, others users will be able to see the NFT you own and rate it on a 10-point basis scale. To do this, there is a Private Collections section on the marketplace;</li>\n          <li><strong>Put your NFT up for direct sale, or shard and invite other users to buy its shares</strong> It is possible to change the price in any time without transaction costs by applying for a signature through your purse</li>\n          <li><strong>Put your NFT up for auction using the auction</strong> providing an opportunity appreciate it and form a market price for other users NFTOPIUM - to the auction participants</li>\n          <li><strong>Donate your NFT, its share or collection to another user</strong> beautifully design a sign of your attention using the Gifts marketplace service.</li>\n        </ol>\n        <p>In the Private collection section, you can publish both individual NFTs and collected you collections that can consist of NFTs and shards. An NFT shard is a token that is a fraction of an integer nft. Nft tokenization is called sharding. Your concepts collections are only limited by your imagination.</p>\n        <p>Once you have created a collection, you can tokenize it directly on the marketplace and publicly (or privately) invite other marketplace users to purchase shares of your collection, or purchase management tokens issued by you collections and thus create a DAO collection, where the holders of the control tokens can propose changes and vote for them. The third option is to create your own</p>\n        <p>Before placing your NFT for trading, set the commission parameters:</p>\n        <ol class="list-style-bracket">\n          <li><strong>if you are a creator</strong> then you can pledge constant royalties from 0% to 51%. When with each resale of the NFT you create, you will receive the corresponding reward from the amounts of all repeat purchases. It is possible to install royalties for a limited number of resale.</li>\n          <li><strong>if you are a collector</strong> and you are also an experienced connoisseur, like recognized censors, whose opinion society is inclined to listen to, and own purchased NFTs at 100% (not shares), then you can set commissions to next resale of this NFT from 0% to 5%. This is the reward for your work on searching, selecting the most outstanding NFTs and presenting them to the world. For getting such a commission does not need to own an NFT. If the creator agrees to install this commission in your favor as a thank you for promoting the created im nft, it is possible.</li>\n        </ol>\n        <p>Marketplace prices are displayed in USD equivalent.</p>',
      WP_FEES_TITLE: "Marketplace fees NFTOPIUM",
      WP_FEES_CONTENT:
        '<p>The total commission from the turnover of NFT and their derivatives on the marketplace is only 2%, at the same time, 50% of it is distributed among users of the NFTOPIUM marketplace. <br>How it works?</p>\n      <p><strong>1. Permanent marketplace royalty is 1% (on all sales).</strong> Out of which:</p>\n      <ul class="list-style-dash">\n        <li>0.5% belongs to the marketplace.</li>\n        <li>0.1% - to users who maintain the database (metadata for nft) marketplace at their facilities (node) and froze staking to confirm their involvement N number of QOU tokens, as well as those who stuck their QUO tokens in favor of these nodes so that they can vote in their place and participate in the development marketplace.</li>\n        <li>The remaining 0.4% is allocated to the support and development recommendation program</li>\n      </ul>\n      <p>NFTOPIUM DAO. That is, to members of the NFTOPIUM community who have someone has staked QUO tokens in the marketing structure. The remuneration is distributed 5 levels by:</p>\n      <ul class="no-list-style padding-left">\n        <li><strong>1 level</strong> - 0.1% of the volume of the steak, in proportion to the total weight of the steaks in all the first levels of the marketing structure. Similarly, as it is considered proportionality of personal steaks.</li>\n        <li><strong>2 level</strong> - 0.1% of the volume of the steak, in proportion to the total weight of the steaks at all second levels of the marketing structure. Similarly, as it is considered proportionality of personal steaks</li>\n        <li><strong>3 level</strong> - 0,1% - || -</li>\n        <li><strong>4 level</strong> - 0,07% - || -</li>\n        <li><strong>5 level</strong> - 0,03% - || -</li>\n      </ul>\n      <p><strong>2. The constant commission of the marketplace on all purchases is 1% (like royalties from sales)</strong> Out of which:</p>\n      <ul class="list-style-dash">\n        <li>0.5% belongs to the marketplace.</li>\n        <li>0.1% - to users who maintain the database (metadata for nft) marketplace at their facilities (node) and froze staking to confirm their involvement N number of QOU tokens, as well as those who staked (frozen) their QUO tokens in favor of these nodes so that they can vote instead of them and participate in marketplace development</li>\n        <li>The remaining 0.4% is allocated to the customer recommendation program. I.e members of the NFTOPIUM community who have someone in their marketing structure buys NFT or their derivatives on the NFTOPIUM platform. Reward distributed over 5 levels:</li>\n      </ul>\n      <ul class="no-list-style padding-left">\n        <li><strong>1 level</strong>  - 0.1% of the purchase amount</li>\n        <li><strong>2 level</strong> - 0,1% - || -</li>\n        <li><strong>3 level</strong> - 0,1% - || -</li>\n        <li><strong>4 level</strong> - 0,07% - || -</li>\n        <li><strong>5 level</strong> - 0,03% - || -</li>\n      </ul>\n      <p>Rewards for these recommendation programs are awarded by a smart contract in QAS tokens once a day to optimize transaction costs. The seller simply gets 2% less than the price the buyer paid. Price for the buyer is shown immediately taking into account these 2%, therefore, in essence, users may not to be distracted from their creative activities, but at the same time to constantly make money on them. That\'s not all, with your own collection, you can create your own index.</p>',
      WP_LQDT_POOL_TITLE: "Liquidity pool",
      WP_LQDT_POOL_CONTENT:
        "<p>NFTOPIUM liquidity pool is a protocol for converting crypto assets into QAS token and vice versa, which is part of the NFTOPIUM marketplace.</p>\n        <p>It is an automatic multi market maker (AMMM) following the example of similar protocols that exist today on the Ethereum blockchain.</p>\n        <p>The main liquidity pool pair is QAS (BEP-20) to USDT (BEP-20). Wherein, if the user wants to exchange one of the BSC-supported crypto assets of the standard BEP-20, the protocol creates a layered conversion. For example: BTCB-USDT-QAS.</p>\n        <p>It is possible to add (or extract) liquidity to the QUO farming pool only by adding QAS / USDT pair (BEP-20) in the ratio of the current token price</p>\n        <p>For direct conversion of QAS / USDT and USDT / QAS in addition to transaction costs BSC network protocol charges a commission of 0.3% and distributes it among the suppliers with liquidity provider tokens</p>",
      WP_DAO_TITLE: "NFTOPIUM DAO",
      WP_DAO_CONTENT:
        '<p>BSC protocol, the main task of which is the gradual creation decentralized autonomous organization of independent users NFTOPIUM for management of the marketplace and its infrastructure, including pool protocols liquidity and NFTOPIUM Fund in the self governance format.</p>\n      <p>An indicator of the readiness of the NFTOPIUM DAO for full autonomy will be the achievement capitalization of NFTOPIUM Fund $ 550,000,000+. Moreover, according to clause 1, in the protocol NFTOPIUM DAO will unfreeze funds owned by the development team and management will become completely independent from the original team</p>\n      <p>Any user can become a member of the NFTOPIUM DAO if they have a personal stake in QUO tokens, while the level of reputation and significance of the vote of the DAO participant depends from factors:</p>\n      <ul class="list-style-dash">\n        <li>the presence of a node that supports the NFTOPIUM DAO protocol chain on the BSC;</li>\n        <li>the volume of a personal steak;</li>\n        <li>the volume of the structural steak;</li>\n        <li>personal account, in which regular activity is traced (operations are not less than 1 time per week);</li>\n        <li>track record of completed tasks aimed at the development of NFTOPIUM DAO, which is transparently available in the DAO information section of the marketplace (development, marketing, PR, strategic development, etc.).</li>\n      </ul>\n      <p>NFTOPIUM DAO members and any other NFTOPIUM users are rewarded for completing tasks aimed at the development of DAO with QAS amounts, the solution of which adopted by voting of the NFTOPIUM DAO members.</p>',
      WP_FUND_TITLE: "NFTOPIUM Fund",
      WP_FUND_CONTENT:
        "<p>Part of the infrastructure of the NFTOPIUM DAO protocol, the purpose of which is to create collections of NFTs and shards, as well as capital in other crypto assets, total capitalization which will exceed $ 550 million. This capitalization is an integral part of capitalization of the entire issue of the QAS token.</p>\n      <p>To accomplish this task, members of the NFTOPIUM DAO can use any effective methods based on our own liquidity pools, for example, such solutions for non-custodial portfolio management like TokenSets. It can be used in the format of providing the QAS token with a basket of shards. This basket can be like unchanged in composition and rebalanced. Smart contract can manage 24/7 a portfolio of shards that it is provided with: according to the strategy specified by the algorithm (robo-sets), or according to the strategy of the chosen portfolio manager (public trading sets). When with this, at any time you can redeem this token with a basket of shards, with which it provided.</p>\n      <p>Other solutions are possible. Fortunately, we are at an early stage of development. technologies and possibilities are limited only by our imagination.</p>",
      WP_ACCOUNT_TITLE: "User's personal account NFTOPIUM",
      WP_ACCOUNT_CONTENT:
        '<p>To create a personal account on the NFTOPIUM marketplace, the user needs bind personal email and any wallet that supports the BSC network. <br>It can be Metamask or Trust Wallet.</p>\n        <p>The user account displays</p>\n        <p><strong>Avatar</strong> (signed immediately, he is a member of the NFTOPIUM DAO or not yet); His name,</p>\n        <p><strong>His name provided during registration;</strong></p>\n        <p><strong>The public address of the linked wallet</strong> (with the option to replace it);</p>\n        <p><strong>Wallet balance</strong></p>\n        <p><strong>All of his NFT</strong> are subdivided into</p>\n        <ul class="list-style-dash">\n          <li>personal;</li>\n          <li>public (those that are set to show for all users) and the number likes under them;</li>\n          <li>NFT and shard collections.</li>\n        </ul>\n        <p> <strong>Also shown:</strong> </p>\n        <ul class="list-style-dash">\n          <li>share in the tokenized collection (if any);</li>\n          <li>index and collection tokens (which he owns);</li>\n          <li>collections created by him DAO, indexes.</li>\n        </ul>\n        <p> <strong>Highlighted separately:</strong> </p>\n        <ul class="list-style-dash">\n          <li>his stake in QUO tokens and how much QAS he earned on it;</li>\n          <li>the stake of its structure in QUO tokens and how much QAS he earned on this;</li>\n          <li>its share in the liquidity pool with details of the amount of QAS and USDT, as well as how much he earned on it;</li>\n          <li>the number of active buyers at each of the 5 levels and how many QAS it is earned commissions for their activity.</li>\n        </ul>\n        <p> <strong>Statistics of his activities:</strong> </p>\n        <ol class="padding-left">\n          <li>Participation in current auctions;</li>\n          <li>Listed NFTs;</li>\n          <li>Purchased, sold NFTs and their derivatives;</li>\n          <li>An overall assessment of the value of his NFT portfolio and other assets;</li>\n          <li>His borrower ratings;</li>\n          <li>His achievements in the implementation of tasks aimed at the development of the NFTOPIUM DAO and rewards for them</li>\n        </ol>',
    },
  },
  currentLang = localStorage.getItem("lang")
    ? localStorage.getItem("lang")
    : "ru",
  langs = {
    ru: { title: "Рус", icon: "assets/images/langs/ru.svg" },
    en: { title: "Eng", icon: "assets/images/langs/en.svg" },
  },
  setLangs = (o) => {
    const e = document.querySelectorAll("[data-lang-key]"),
      t = document.getElementsByTagName("html")[0];
    t.setAttribute("lang", o),
      e.forEach((e) => {
        var t;
        e.hasAttribute("data-lang-key") &&
          ((t = e.dataset.langKey),
          translateData[o].hasOwnProperty(t) &&
            (e.innerHTML = translateData[o][t]));
      });
  },
  $currentLang = document.querySelector(".js-current-lang");
($currentLang.innerHTML = `<img src="${langs[currentLang].icon}">${langs[currentLang].title}`),
  setLangs(currentLang);
const langSwitcher = document.querySelectorAll(".js-lang-switcher");
langSwitcher.forEach((e) => {
  e.addEventListener("click", (e) => {
    const t = e.target.classList.contains("js-lang-switcher")
      ? e.target
      : e.target.closest(".js-lang-switcher");
    var o = t.innerHTML,
      e = t.getAttribute("id");
    ($currentLang.innerHTML = o), localStorage.setItem("lang", e), setLangs(e);
  });
});
